Revit 2024 API
ParameterTypeId.FabricationPartDiameterOut Property
 "Main Secondary Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationPartDiameterOut { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartDiameterOut As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationPartDiameterOut {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace